//**************************************************************************************************************
// Параметры подключения к WIFI
//**************************************************************************************************************
#define SAMOVAR_HOST "samovar"
#define SAMOVAR_SSID "ssid"
#define SAMOVAR_PASSWORD "pwd"
#define SAMOVAR_AUTH "auth-auth"
//**************************************************************************************************************

//**************************************************************************************************************
// Настройки предельных значений для контроля автоматики
//**************************************************************************************************************
//Температура воды, при достижении которой будет оповещен оператор
#define ALARM_WATER_TEMP 70
//Максимальное значение температуры воды, при котором выключится питание
#define MAX_WATER_TEMP 75
//Максимальное значение температуры пара, при котором выключится питание
#define MAX_STEAM_TEMP 99.8
//Значение температуры датчика пара, при котором колонна перейдет из режима разгона в рабочий режим
#define CHANGE_POWER_MODE_STEAM_TEMP 76.1
//Значение температуры датчика в кубе, при котором откроется клапан подачи воды
#define OPEN_VALVE_TANK_TEMP 59.5
//Сопротивление тэна для расчета мощности
#define HEATER_RESISTANT 15.2
//**************************************************************************************************************

//**************************************************************************************************************
// Настройки дополнительных параметров
//**************************************************************************************************************
#define SAMOVAR_LOG_PERIOD 3                // периодичность записи данных о температуре в файл (раз в три секунды, оптимально с точки зрения объема файла)
#define TIMEZONE 3                          // таймзона того места, где будет применяться устройство
//**************************************************************************************************************
